# MechanicalEquipmentSetBeingDeleted Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..MechanicalEquipmentSetBeingDeleted Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The mechanical equipment set was deleted because it no longer contained any members.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MechanicalEquipmentSetBeingDeleted { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MechanicalEquipmentSetBeingDeleted As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MechanicalEquipmentSetBeingDeleted {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace